package com.xtree.bet.constant;

import android.util.ArrayMap;

import java.util.Map;

public class FBMatchPeriod {
    private int code;
    private String desc;

    private static Map<String, String> map = new ArrayMap<>();

    // todo 继续补充所有的 see enum: match_period
    public static String getMatchPeriod(String code){
        if(map.isEmpty()){
            // 足球
            map.put("1001", "未开始");
            map.put("1002", "上半场");
            map.put("1003", "中场休息");
            map.put("1004", "下半场");
            map.put("1005", "常规时间结束");
            map.put("1006", "加时赛上半场");
            map.put("1007", "加时赛半场时间");
            map.put("1008", "加时赛下半场");
            map.put("1009", "加时赛结束");
            map.put("1010", "点球大战");
            map.put("1011", "比赛结束");
            map.put("1012", "等待加时");
            map.put("1013", "等待点球大战");
            map.put("1014", "点球大战结束");
            map.put("1015", "中断");
            map.put("1016", "腰斩");

            // 篮球
            map.put("3001", "未开始");
            map.put("3002", "上半场");
            map.put("3003", "中场休息");
            map.put("3004", "下半场");
            map.put("3005", "第一节");
            map.put("3006", "中场休息 1/2");
            map.put("3007", "第二节");
            map.put("3008", "中场休息 2/3");
            map.put("3009", "第三节");
            map.put("3010", "中场休息 3/4");
            map.put("3011", "第四节");
            map.put("3012", "加时");
            map.put("3013", "常规时间结束");
            map.put("3014", "比赛结束");
            map.put("3015", "等待加时");
            map.put("3016", "加时赛结束");
            map.put("3017", "延期");
            map.put("3018", "中断");
            map.put("3019", "废弃");

            // 网球
            map.put("5001", "未开始");
            map.put("5002", "第1盘");
            map.put("5003", "第1盘结束");
            map.put("5004", "第2盘");
            map.put("5005", "第2盘结束");
            map.put("5006", "第3盘");
            map.put("5007", "第3盘结束");
            map.put("5008", "第4盘");
            map.put("5009", "第4盘结束");
            map.put("5010", "第5盘");
            map.put("5011", "比赛结束");
            map.put("5012", "比赛结束");
            map.put("5013", "比赛结束");
            map.put("5014", "比赛结束");
            map.put("5015", "比赛结束");
            map.put("5016", "选手退赛");
            map.put("5019", "推迟");
            map.put("5020", "中断");
            map.put("5021", "废弃");

            // 斯洛克

            map.put("16001", "未开始");
            map.put("16002", "进行中");
            map.put("16003", "局中休息");
            map.put("16004", "暂停");
            map.put("16005", "结束");
            map.put("16006", "结束");
            map.put("16007", "结束");
            map.put("16008", "结束");
            map.put("16009", "结束");
            map.put("16010", "结束");
            map.put("16011", "结束");
            map.put("16012", "推迟");
            map.put("16013", "中断");
            map.put("16014", "废弃");




            // 排球
            map.put("7001", "未开始");
            map.put("7003", "第一局");
            map.put("7004", "打破第一顶第一底");
            map.put("7005", "局 一 底");
            map.put("7006", "第一局结束");
            map.put("7008", "第二局");
            map.put("7009", "打破第二顶第二底");
            map.put("7010", "局 二 底");
            map.put("7011", "第二局结束");
            map.put("7013", "第三局");
            map.put("7014", "打破第三顶第三底");
            map.put("7015", "局三底");
            map.put("7016", "第三局结束");
            map.put("7018", "第四局");
            map.put("7019", "打破第四顶第四底");
            map.put("7020", "局四底");
            map.put("7021", "第四局结束");
            map.put("7023", "第五局");
            map.put("7024", "打破第五顶第五底");
            map.put("7025", "局五底");
            map.put("7026", "第五局结束");
            map.put("7028", "第六局");
            map.put("7029", "打破第六顶第六底");
            map.put("7030", "局六底");
            map.put("7033", "第七局");
            map.put("7034", "打破第七顶第七底");
            map.put("7035", "局七底");
            map.put("7038", "第八局");
            map.put("7039", "打破第八顶第八底");
            map.put("7040", "局八底");
            map.put("7041", "第八局结束");
            map.put("7043", "第九局");
            map.put("7044", "打破第九顶第九底");
            map.put("7045", "局九底");
            map.put("7046", "第九局结束");
            map.put("7048", "额外局");
            map.put("7049", "打破 EI 顶部 EI 底部");
            map.put("7050", "额外的局底");
            map.put("7051", "结束");
            map.put("7052", "中断");
            map.put("7053", "废弃");



            // 排球
            map.put("13001", "未开始");
            map.put("13002", "第1局");
            map.put("13003", "第1局结束");
            map.put("13004", "第2局");
            map.put("13005", "第2局结束");
            map.put("13006", "第3局");
            map.put("13007", "第3局结束");
            map.put("13008", "第4局");
            map.put("13009", "第4局结束");
            map.put("13010", "第5局");
            map.put("13011", "第5局结束");
            map.put("13012", "第6局");
            map.put("13013", "第6局结束");
            map.put("13014", "第7局");
            map.put("13015", "比赛结束");
            map.put("13016", "等待金局");
            map.put("13017", "金局");
            map.put("13018", "金局结束");
            map.put("13019", "比赛结束");
            map.put("13020", "比赛结束");
            map.put("13021", "比赛结束");
            map.put("13022", "比赛结束");
            map.put("13023", "延期");
            map.put("13024", "中断");
            map.put("13025", "废弃");

            // 羽毛球
            map.put("47001", "未开始");
            map.put("47002", "第一盘");
            map.put("47003", "第一盘结束");
            map.put("47004", "第二盘");
            map.put("47005", "第二盘结束");
            map.put("47006", "第三盘");
            map.put("47007", "第三盘结束");
            map.put("47008", "第四盘");
            map.put("47009", "第四盘结束");
            map.put("47010", "第五盘");
            map.put("47015", "比赛结束");
            map.put("47016", "比赛结束");
            map.put("47017", "比赛结束");
            map.put("47018", "比赛结束");
            map.put("47019", "比赛结束");
            map.put("47020", "比赛结束");
            map.put("47021", "比赛结束");
            map.put("47022", "推迟");
            map.put("47023", "中断");
            map.put("47024", "废弃");


            // 乒乓球
            map.put("15001", "未开始");
            map.put("15002", "第一盘");
            map.put("15003", "第一盘结束");
            map.put("15004", "第二盘");
            map.put("15005", "第二盘结束");
            map.put("15006", "第三盘");
            map.put("15007", "第三盘结束");
            map.put("15008", "第四盘");
            map.put("15009", "第四盘结束");
            map.put("15010", "第五盘");
            map.put("15011", "第五盘结束");
            map.put("15012", "第六盘");
            map.put("15013", "第六盘结束");
            map.put("15014", "第七盘");
            map.put("15015", "比赛结束");
            map.put("15016", "比赛结束");
            map.put("15017", "比赛结束");
            map.put("15018", "比赛结束");
            map.put("15019", "比赛结束");
            map.put("15020", "比赛结束");
            map.put("15021", "比赛结束");
            map.put("15022", "推迟");
            map.put("15023", "中断");
            map.put("15024", "废弃");


            // 冰球
            map.put("2001", "未开始");
            map.put("2002", "第一节");
            map.put("2003", "第一节结束");
            map.put("2004", "第二节");
            map.put("2005", "中场休息1/2");
            map.put("2006", "第三节");
            map.put("2007", "比赛结束");
            map.put("2008", "等待加时");
            map.put("2009", "加时");
            map.put("2010", "加时结束");
            map.put("2011", "等待点球");
            map.put("2012", "点球");
            map.put("2013", "点球结束");
            map.put("2014", "中断");
            map.put("2015", "废弃");
            map.put("2016", "比赛结束");

            //拳击
            map.put("18001", "未开始");
            map.put("18020", "结束");
            map.put("18021", "延迟");
            map.put("18022", "取消");


            // 沙滩排球
            map.put("51001", "未开始");
            map.put("51002", "第一局");
            map.put("51003", "第一局结束");
            map.put("51004", "第二局");
            map.put("51005", "第二局结束");
            map.put("51006", "第三局");
            map.put("51007", "第三局结束");
            map.put("51008", "第四局");
            map.put("51009", "第四局结束");
            map.put("51010", "第五局");
            map.put("51011", "比赛结束");
            map.put("51012", "比赛结束");
            map.put("51013", "比赛结束");
            map.put("51014", "比赛结束");
            map.put("51015", "比赛结束");
            map.put("51016", "中断");
            map.put("51017", "比赛结束");


            // 手球
            map.put("8001", "未开始");
            map.put("8002", "上半场");
            map.put("8003", "半场");
            map.put("8004", "下半场");
            map.put("8005", "常规结束");
            map.put("8006", "等待加时");
            map.put("8007", "加时上半场");
            map.put("8008", "加时半场");
            map.put("8009", "加时下半场");
            map.put("8010", "加时结束");
            map.put("8011", "等待处罚");
            map.put("8012", "点球");
            map.put("8013", "点球结束");
            map.put("8014", "比赛结束");
            map.put("8015", "中断");
            map.put("8016", "废弃");
        }
        return map.get(code);
    }
}
